In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, 
dtype='l'))
print(s1, s2, s3)

0     2
1     4
2     4
3     2
4     4
     ..
95    1
96    1
97    2
98    2
99    3
Length: 100, dtype: int32 0     3
1     2
2     2
3     2
4     3
     ..
95    3
96    2
97    2
98    3
99    2
Length: 100, dtype: int32 0     23797
1     29246
2     26159
3     20751
4     11514
      ...
95    28893
96    14633
97    20272
98    13245
99    16153
Length: 100, dtype: int32

In [3]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  2  3  23797
1  4  2  29246
2  4  2  26159
3  2  2  20751
4  4  3  11514

In [4]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 
'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      2       3            23797
1      4       2            29246
2      4       2            26159
3      2       2            20751
4      4       3            11514

In [10]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       4
2       4
3       2
4       4
..    ...
95  28893
96  14633
97  20272
98  13245
99  16153

[300 rows x 1 columns]

In [9]:
# no the index are kept but the length of the DataFrame is 300
len(bigcolumn)
300

300